// 编写一个用菜单的形式分别选择求1~100当中奇数总和(1)和韩信点兵问题(2)
// 韩信点兵(2)问题如下：据说韩信的数学水平也非常高超，他在点兵的时候，为了知道有多少兵，
//		同时又能保住军事机密，便让士兵排队报数：按从1至5报数，记下最末一个士兵报的数为1
//		再按从1至6报数，记下最末一个士兵报的数为5
//		再按从1至7报数，记下最末一个士兵报的数为4
//		最后按从1至11报数，最末一个士兵报的数为10
//		请编写程序计算韩信至少有多少兵。
#include"stdio.h"
int oddsum()	//1~100当中奇数总和
{
	int i, sum = 0;
	for (i = 1; i <= 100; i += 2)
		sum += i;
	return sum;
}
int hxdb()
{
	int n;
	for(n=1;;n++)
		if ((n % 5 == 1) && (n % 6 == 5) && (n % 7 == 4) && (n % 11 == 10))
			break;
	return n;
}
int main()
{
	int i;
	printf("1、1~100当中奇数总和\n");
	printf("2、韩信点兵问题\n");
	printf("请输入您的选择：\n");
	scanf_s("%d", &i);
	if (i == 1)
		printf("%d", oddsum());
	if (i == 2)
		printf("%d", hxdb());
	return 0;

}
